; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_6)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 - boat
		p0 p1 p2 p3 p4 p5 - person
	)

  (:init
		(= (x b0) 5)
(= (y b0) 0)
(= (x b1) -10)
(= (y b1) 0)
(= (x b2) 4)
(= (y b2) 0)
(= (x b3) 4)
(= (y b3) 0)
(= (x b4) 5)
(= (y b4) 0)
(= (x b5) 10)
(= (y b5) 0)
(= (x b6) 3)
(= (y b6) 0)
(= (x b7) 8)
(= (y b7) 0)
(= (x b8) -9)
(= (y b8) 0)
(= (x b9) -7)
(= (y b9) 0)
(= (x b10) -5)
(= (y b10) 0)
(= (x b11) 1)
(= (y b11) 0)
(= (x b12) 10)
(= (y b12) 0)
(= (x b13) 9)
(= (y b13) 0)

		(= (d p0) 71)
(= (d p1) 94)
(= (d p2) 100)
(= (d p3) 60)
(= (d p4) 78)
(= (d p5) 19)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
		)
	)
)

; plan
1. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 0 to 1.5
   goals met: 0 of 6
2. (go_north_east b11)
   changed: (x b11) from 2.5 to 4, (y b11) from 1.5 to 3
   goals met: 0 of 6
3. (go_north_east b11)
   changed: (x b11) from 4 to 5.5, (y b11) from 3 to 4.5
   goals met: 0 of 6
4. (go_north_east b11)
   changed: (x b11) from 5.5 to 7, (y b11) from 4.5 to 6
   goals met: 0 of 6
5. (go_north_east b11)
   changed: (x b11) from 7 to 8.5, (y b11) from 6 to 7.5
   goals met: 0 of 6
6. (go_north_east b11)
   changed: (x b11) from 8.5 to 10, (y b11) from 7.5 to 9
   goals met: 0 of 6
7. (go_north_west b11)
   changed: (x b11) from 10 to 8.5, (y b11) from 9 to 10.5
   goals met: 0 of 6
8. (go_north_west b11)
   changed: (x b11) from 8.5 to 7, (y b11) from 10.5 to 12
   goals met: 0 of 6
9. (go_north_west b11)
   changed: (x b11) from 7 to 5.5, (y b11) from 12 to 13.5
   goals met: 0 of 6
10. (go_north_west b11)
   changed: (x b11) from 5.5 to 4, (y b11) from 13.5 to 15
   goals met: 0 of 6
11. (go_north_west b11)
   changed: (x b11) from 4 to 2.5, (y b11) from 15 to 16.5
   goals met: 0 of 6
12. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 16.5 to 18
   goals met: 0 of 6
13. (go_north_west b11)
   changed: (x b11) from 1 to -0.5, (y b11) from 18 to 19.5
   goals met: 0 of 6
14. (save_person b11 p5)
   added: (saved p5)
   goals met: 1 of 6
15. (go_north_east b11)
   changed: (x b11) from -0.5 to 1, (y b11) from 19.5 to 21
   goals met: 1 of 6
16. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 21 to 22.5
   goals met: 1 of 6
17. (go_north_east b11)
   changed: (x b11) from 2.5 to 4, (y b11) from 22.5 to 24
   goals met: 1 of 6
18. (go_north_east b11)
   changed: (x b11) from 4 to 5.5, (y b11) from 24 to 25.5
   goals met: 1 of 6
19. (go_north_east b11)
   changed: (x b11) from 5.5 to 7, (y b11) from 25.5 to 27
   goals met: 1 of 6
20. (go_north_east b11)
   changed: (x b11) from 7 to 8.5, (y b11) from 27 to 28.5
   goals met: 1 of 6
21. (go_north_east b11)
   changed: (x b11) from 8.5 to 10, (y b11) from 28.5 to 30
   goals met: 1 of 6
22. (go_north_east b11)
   changed: (x b11) from 10 to 11.5, (y b11) from 30 to 31.5
   goals met: 1 of 6
23. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 31.5 to 33
   goals met: 1 of 6
24. (go_north_east b11)
   changed: (x b11) from 13 to 14.5, (y b11) from 33 to 34.5
   goals met: 1 of 6
25. (go_north_east b11)
   changed: (x b11) from 14.5 to 16, (y b11) from 34.5 to 36
   goals met: 1 of 6
26. (go_north_east b11)
   changed: (x b11) from 16 to 17.5, (y b11) from 36 to 37.5
   goals met: 1 of 6
27. (go_north_east b11)
   changed: (x b11) from 17.5 to 19, (y b11) from 37.5 to 39
   goals met: 1 of 6
28. (go_north_east b11)
   changed: (x b11) from 19 to 20.5, (y b11) from 39 to 40.5
   goals met: 1 of 6
29. (go_north_east b11)
   changed: (x b11) from 20.5 to 22, (y b11) from 40.5 to 42
   goals met: 1 of 6
30. (go_north_east b11)
   changed: (x b11) from 22 to 23.5, (y b11) from 42 to 43.5
   goals met: 1 of 6
31. (go_north_east b11)
   changed: (x b11) from 23.5 to 25, (y b11) from 43.5 to 45
   goals met: 1 of 6
32. (go_north_east b11)
   changed: (x b11) from 25 to 26.5, (y b11) from 45 to 46.5
   goals met: 1 of 6
33. (go_north_west b11)
   changed: (x b11) from 26.5 to 25, (y b11) from 46.5 to 48
   goals met: 1 of 6
34. (go_north_west b11)
   changed: (x b11) from 25 to 23.5, (y b11) from 48 to 49.5
   goals met: 1 of 6
35. (go_north_west b11)
   changed: (x b11) from 23.5 to 22, (y b11) from 49.5 to 51
   goals met: 1 of 6
36. (go_north_west b11)
   changed: (x b11) from 22 to 20.5, (y b11) from 51 to 52.5
   goals met: 1 of 6
37. (go_north_west b11)
   changed: (x b11) from 20.5 to 19, (y b11) from 52.5 to 54
   goals met: 1 of 6
38. (go_north_west b11)
   changed: (x b11) from 19 to 17.5, (y b11) from 54 to 55.5
   goals met: 1 of 6
39. (go_north_west b11)
   changed: (x b11) from 17.5 to 16, (y b11) from 55.5 to 57
   goals met: 1 of 6
40. (go_north_west b11)
   changed: (x b11) from 16 to 14.5, (y b11) from 57 to 58.5
   goals met: 1 of 6
41. (go_north_west b11)
   changed: (x b11) from 14.5 to 13, (y b11) from 58.5 to 60
   goals met: 1 of 6
42. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 60 to 61.5
   goals met: 1 of 6
43. (go_north_west b11)
   changed: (x b11) from 11.5 to 10, (y b11) from 61.5 to 63
   goals met: 1 of 6
44. (go_north_west b11)
   changed: (x b11) from 10 to 8.5, (y b11) from 63 to 64.5
   goals met: 1 of 6
45. (go_north_west b11)
   changed: (x b11) from 8.5 to 7, (y b11) from 64.5 to 66
   goals met: 1 of 6
46. (go_north_west b11)
   changed: (x b11) from 7 to 5.5, (y b11) from 66 to 67.5
   goals met: 1 of 6
47. (save_person b11 p3)
   added: (saved p3)
   goals met: 2 of 6
48. (go_north_west b11)
   changed: (x b11) from 5.5 to 4, (y b11) from 67.5 to 69
   goals met: 2 of 6
49. (go_north_west b11)
   changed: (x b11) from 4 to 2.5, (y b11) from 69 to 70.5
   goals met: 2 of 6
50. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 70.5 to 72
   goals met: 2 of 6
51. (save_person b11 p0)
   added: (saved p0)
   goals met: 3 of 6
52. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 72 to 73.5
   goals met: 3 of 6
53. (go_north_east b11)
   changed: (x b11) from 2.5 to 4, (y b11) from 73.5 to 75
   goals met: 3 of 6
54. (go_north_east b11)
   changed: (x b11) from 4 to 5.5, (y b11) from 75 to 76.5
   goals met: 3 of 6
55. (go_north_east b11)
   changed: (x b11) from 5.5 to 7, (y b11) from 76.5 to 78
   goals met: 3 of 6
56. (go_north_east b11)
   changed: (x b11) from 7 to 8.5, (y b11) from 78 to 79.5
   goals met: 3 of 6
57. (go_north_east b11)
   changed: (x b11) from 8.5 to 10, (y b11) from 79.5 to 81
   goals met: 3 of 6
58. (go_north_east b11)
   changed: (x b11) from 10 to 11.5, (y b11) from 81 to 82.5
   goals met: 3 of 6
59. (go_north_west b11)
   changed: (x b11) from 11.5 to 10, (y b11) from 82.5 to 84
   goals met: 3 of 6
60. (go_north_west b11)
   changed: (x b11) from 10 to 8.5, (y b11) from 84 to 85.5
   goals met: 3 of 6
61. (go_north_west b11)
   changed: (x b11) from 8.5 to 7, (y b11) from 85.5 to 87
   goals met: 3 of 6
62. (save_person b11 p4)
   added: (saved p4)
   goals met: 4 of 6
63. (go_north_west b11)
   changed: (x b11) from 7 to 5.5, (y b11) from 87 to 88.5
   goals met: 4 of 6
64. (go_north_west b11)
   changed: (x b11) from 5.5 to 4, (y b11) from 88.5 to 90
   goals met: 4 of 6
65. (go_north_west b11)
   changed: (x b11) from 4 to 2.5, (y b11) from 90 to 91.5
   goals met: 4 of 6
66. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 91.5 to 93
   goals met: 4 of 6
67. (go_north_west b11)
   changed: (x b11) from 1 to -0.5, (y b11) from 93 to 94.5
   goals met: 4 of 6
68. (save_person b11 p1)
   added: (saved p1)
   goals met: 5 of 6
69. (go_north_east b11)
   changed: (x b11) from -0.5 to 1, (y b11) from 94.5 to 96
   goals met: 5 of 6
70. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 96 to 97.5
   goals met: 5 of 6
71. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 97.5 to 99
   goals met: 5 of 6
72. (go_north_west b11)
   changed: (x b11) from 1 to -0.5, (y b11) from 99 to 100.5
   goals met: 5 of 6
73. (save_person b11 p2)
   added: (saved p2)
   goals met: 6 of 6
